Revit 2027 API
FamilyInstance.ToRoom(Phase) Property
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Room this[
	Phase phase
] { get; }
Public ReadOnly Property ToRoom (
	phase As Phase
) As Room
	Get
public:
property Room^ ToRoom[Phase^ phase] {
	Room^ get (Phase^ phase);
}
member ToRoom : Room with get
Parameters
phase Phase
Property Value
Room
See Also
Reference
FamilyInstance Class
ToRoom Overload
Autodesk.Revit.DB Namespace